This is the plan:

```
  ~ update in-place

Terraform will perform the following actions:

  # module.lambda_start_release.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "start-release"
      ~ last_modified                  = "2024-07-13T15:08:03.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-1:890664054962:function:start-release:3" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-1:890664054962:function:start-release:3/invocations" -> (known after apply)
      ~ source_code_hash               = "DHpRFWXi67wUMDzC2nkUG4ssZv8wIeOgjzpeFrt0kPI=" -> "ireq9lL5XEb+zyoSUjmCoWurC84GsNxsVGtQIySjFW0="
        tags                           = {}
      ~ version                        = "3" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

I'm merging this because it's the same before the update